# 题目描述 - uniquePaths
# 一个机器人在m×n大小的地图的左上角（起点，下图中的标记“start"的位置）。
# 机器人每次向下或向右移动。机器人要到达地图的右下角。（终点，下图中的标记“Finish"的位置）。
# 可以有多少种不同的路径从起点走到终点？

# 题目描述 - climbStairs
# 你在爬楼梯，需要n步才能爬到楼梯顶部
# 每次你只能向上爬1步或者2步。有多少种方法可以爬到楼梯顶部？

# 题目描述 - minPathSum
# 给定一个由非负整数填充的m x n的二维数组，现在要从二维数组的左上角走到右下角，请找出路径上的所有数字之和最小的路径。
# 注意：你每次只能向下或向右移动。

# 题目描述 - minDistance
# 给定两个单词word1和word2，请计算将word1转换为word2至少需要多少步操作。
# 你可以对一个单词执行以下3种操作：
# a）在单词中插入一个字符
# b）删除单词中的一个字符
# c）替换单词中的一个字符

# 题目描述 - unique-paths-2
# 继续思考题目"Unique Paths":
# 如果在图中加入了一些障碍，有多少不同的路径？
# 分别用0和1代表空区域和障碍

# 题目描述 - distinct-subsequences
# 给定两个字符串S和T，返回S子序列等于T的不同子序列个数有多少个？
# 字符串的子序列是由原来的字符串删除一些字符（也可以不删除）在不改变相对位置的情况下的剩余字符（例如，"ACE"is a subsequence of"ABCDE"但是"AEC"不是）

# 题目描述 - candy
# 有N个小朋友站在一排，每个小朋友都有一个评分
# 你现在要按以下的规则给孩子们分糖果：
# 每个小朋友至少要分得一颗糖果
# 分数高的小朋友要他比旁边得分低的小朋友分得的糖果多
# 你最少要分发多少颗糖果？

# 题目描述 - interleaving-string
# 给出三个字符串s1, s2, s3,判断s3是否可以由s1和s2交织而成。

# 题目描述 - palindrome-partitioning-2
# 给出一个字符串s，分割s使得分割出的每一个子串都是回文串
# 计算将字符串s分割成回文分割结果的最小切割数
# 例如:给定字符串s="aab",
# 返回1，因为回文分割结果["aa","b"]是切割一次生成的。

# 题目描述 - word-break
# 给定一个字符串s和一组单词dict，判断s是否可以用空格分割成一个单词序列，使得单词序列中所有的单词都是dict中的单词（序列可以包含一个或多个单词）。

# 题目描述 - subsets-2
# 给出一个可能包含重复元素的整数集合S，返回该整数集合的所有子集。

# 题目描述 - decode-ways
# 字母加密有多少种解法

# 题目描述 - subsets
# 现在有一个没有重复元素的整数集合S，求S的所有子集

# 题目描述 - word-break-2
# 给定一个字符串s和一组单词dict，在s中添加空格将s变成一个句子，使得句子中的每一个单词都是dict中的单词
# 返回所有可能的结果

if __name__ == '__main__':
    pass